/*
 Кожному розділу надати маркери - терміни (слова або сполучення), які введені в даному розділі.
В тексті розділу знайти маркер іншого розділу - це залежність
Знайти послідовність розділів, яка мінімізує кількість зворотних залежностей.

Сила залежності - кількість маркерів

Морфер:
[[https://www.npmjs.com/package/morpher-ws3-client/v/1.0.8]]

 */ 


/** TODO
 * Наповнювати файл markers.txt
 * Створити Parts з файлу markers.txt
 * [Додати падіжні форми маркерів]
 * Заповнити поле body з файлів лекцій
 * Заповнити поле deps завдяки аналізу
 */



import { Part, Parts } from './src/Parts.js';


const parts = new Parts();
parts.bodyFromAllLects()
console.log(parts);


